Sweet98/Test2016/source/Gen6FoundationApp/FoundationApp/PSOC/PSoC_Engine_ISSP.c
//======================================================================================
//	Revision information
//======================================================================================
// $RCSfile: Gen6FoundationApp/FoundationApp/PSOC/PSoC_Engine_ISSP.c $
// $Revision: 1.8 $
// $Date: 2011/09/09 14:54:57EDT $

/// GENERAL DESCRIPTION
//**************************************************************************************
//
//  ISSP Flash management functions for the Engine PSoC
//
//	   Implements a full reset and reflash of the Cypress CY8C24423A.  Refer to AN2026, AN2026a and AN2015
//		from Cypress MicroSystems for full details.  The port pins used are Px.x, Px,y, and Pz.n.  Note - Interrupts are disabled only
//		during flashing when a stable clock is required.  We control SCLK at all times.  SDATA is only relinquished for the eight
//		clocks to read a byte.  The PSOC seems to have a weak drive when pulling the SDATA line low so we use slowed clocking when
//		reading and for some reason when we are waiting for it to complete a block read.  Reads are clocked on rising edges
//		and writes are clocked on falling edges.
//
//				Flashing proceeds as follows:
//
//           1  Acquire PSOC
//           2  Send Init1, Init2 & Init3 vectors
//           3  Verify chip ID
//           4  Execute bulk erase
//           5  Load 64 byte block in SRAM
//           6  Flash block
//           7  Repeat for all blocks
//           9  Set security level for each block
//           10 Verify checksum
//
//				 - COMMANDS are sent as vector arrays (bitstreams of 22bits each in arrays)
//             		each bitstream is STORED AS a 24bit unsigned int and has the form:
//							0CCC CCCC CCCC CCCC CCCC CCCC CCCC CCC0
//							|\___________________________________/|
//							|					|				  \- 1 additional zero bit padding which is not sent
//							|					|
//							|					\-	22 bits of Command/vector info are sent
//							\-	1 zero bit of padding is not sent
//
//           - WRITES are SENT AS a 22 bit bitstream containing address and data of the form
//					CCC CCAA AAAA DDDD DDDD 000 the trailing zeros are ignored by the PSOC
//
//           - Byte READS are done by sending an 11bit bitstream containing the address, clocking a
//             high Z transition to read, followed by an 8bit read, another high Z transition back to write.
//					CCC CCAA AAAA Z DDDD DDDD Z
//					\___________/  | \________/  \- Transition from read clocked
//							|	  |		|
//							|	  |		\- Read
//							|	  \- Transiton to read clocked
//							\- Write vector command + 6bit address
//
//					high z clock transition to read is low  /^\_/^ to high
//
//					high z clock transition from read is high  \_/^\_ to low
//
//				 -	ID and checksum are read as CCC CCCC CCCC Z DDDD DDDD Z
//
//
//**************************************************************************************************

#include	"db_chrio.h"	// Serial port character output routines
#include	<stdio.h>		/* standard I/O functions					*/
#include	<stdlib.h>		/* standard library functions				*/
#include	<string.h>		/* standard string functions				*/
#include "Timeout.h"
#include "interrupts.h"
#include "Menu.h"
#include "ProductConfiguration.h"
#include "PSoC_Engine_ISSP.h"
#include "PSoC_27xxx_Vectors.h"
#include "PSoC_MPx_Engine_ROM.h"       // PSoC code for 5600's with 26x series PSoC
#include "ReaderConfiguration.h"
#ifndef SCAN_DRIVER_CONTROL
#define SCAN_DRIVER_CONTROL
	#include "scandrivermatrixinterface.h"
	//#include "vars.h"
#endif

#define	DEBUG	IsDebugOn			/* set to one to enable psoc debug statements for now */

#define	ENG_CYCLE_SCLK	ENG_PSOC_SCLK_HIGH; \
							HALF_BIT_DELAY; \
							ENG_PSOC_SCLK_LOW;  \
							HALF_BIT_DELAY

   // For some reason ??? we need this slower clock when waiting for the PSOC to do a Block Read
#define	ENG_CYCLE_SCLK_SLOW	ENG_PSOC_SCLK_HIGH; \
									HALF_BIT_DELAY_IN_READ_MODE; \
									ENG_PSOC_SCLK_LOW;  \
									HALF_BIT_DELAY_IN_READ_MODE

#define  ENG_HIGH_Z_CYCLE_ENTERING_READ	ENG_PSOC_SCLK_HIGH; 	\
											HALF_BIT_DELAY;	\
											ENG_PSOC_SCLK_LOW; 	\
											HALF_BIT_DELAY; 	\
											ENG_PSOC_SCLK_HIGH; 	\
											HALF_BIT_DELAY_IN_READ_MODE

#define  ENG_HIGH_Z_CYCLE_LEAVING_READ	ENG_PSOC_SCLK_LOW; 	\
											HALF_BIT_DELAY_IN_READ_MODE; \
											ENG_PSOC_SCLK_HIGH; 	\
											HALF_BIT_DELAY; 	\
											ENG_PSOC_SCLK_LOW; 	\
											HALF_BIT_DELAY

#define	LOW		0
#define	HIGH	1
#define	READ_PSOC_ID1			0x00f8		// When read function adds prefix b101 we get b101 1111 1000
#define	READ_PSOC_ID2			0x00f9		// When read function adds prefix b101 we get b101 1111 1001
#define	READ_CHECKSUM_BYTE1		0x05f9
#define	READ_CHECKSUM_BYTE2		0x05f8

#define	HALF_BIT_DELAY	asm("nop");asm("nop");asm("nop");asm("nop")
#define	HALF_BIT_DELAY_IN_READ_MODE		DELAY_BIT_TIME(4)	 // When reading the PSOC controls SDATA, for some reason the
														 // falling edge is very slow hence the slower clocking is used
#define	DELAY_BIT_TIME(k)		\
	{						\
		int j = k;				\
		while( j-- > 0 )			\
			{				\
				asm("nop");	\
				asm("nop");	\
				asm("nop");	\
				asm("nop");	\
				asm("nop");	\
				asm("nop");	\
				asm("nop");	\
				asm("nop");	\
				asm("nop");	\
				asm("nop");	\
				asm("nop");	\
				asm("nop");	\
				asm("nop");	\
			}				\
	}

//Protection levels
// 0 - External read enabled, all writes enabled
// 1 - External read disabled, all writes enabled
// 2 - External read disabled, external writes disabled, internal writes enabled
// 3 - External read disabled, all writes disabled

const unsigned int pEng24SecurityArray[]=
/*	    00,    01,    02,   03,   04,    05,    06,    07,   08,    09,    10,    11,    12,   13,   14,   15 */
{
	0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x55,0x01,
//	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,	//No Protection
	0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
	0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,
	0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff
};

extern void Setup27xxx(void);
void reset_psoc(void);
unsigned int EngSetComLines(unsigned int);
unsigned int EngAcquirePsoc(void);
unsigned int EngVerifyIdPsoc(void);
unsigned int EngVerify_flash_psoc(void);
unsigned int EngProgramFlashPsoc(void);
unsigned int EngReadIdPsoc(void);
unsigned int EngSecure_psoc(void);
unsigned int EngVerifyFlashChecksumPsoc(void);
void EngResetPsoc(void);
unsigned int EngSendVectorArrayToPsoc(const unsigned int *pVectorArray);
void EngSend22bitStreamToPsoc(unsigned int bitstream);
inline void EngSend11bitStreamToPsoc(unsigned int bitstream);
inline unsigned int EngRead8bitStreamFromPsoc(void);
unsigned int EngWaitForSdataLowPsoc(void);
unsigned int EngWaitForSdataLowPsocSlow(void);	    // For some reason ??? we need this slower clocking when waiting for the PSOC to do a Block Read
unsigned int EngWriteByteToSramPsoc(unsigned int data, unsigned int address);
unsigned int EngReadByteFromSramPsoc(unsigned int address);
unsigned int EngReadFlashChecksumPsoc();
unsigned int EngCalculateFlashChecksumPsoc(void);
const unsigned char * EngGetPsocRamCopy(unsigned int * length);
CTimeout wait(0);
unsigned int FlashEnginePsoc(const unsigned char *pPsocHexFile, unsigned int length);
int EraseEnginePsoc(void);
unsigned int SecureEnginePsoc(const unsigned int * pSecurityArray);

