Sweet98/Test2016/source/Gen6FoundationApp/FoundationApp/PSOC/PSoC_Engine_ISSP.c
bool IsDebugOn = false;
bool EnginePSoCflash = false;

unsigned int EngHexSize;
const unsigned char* pEngHExInRam;
char * MsgBuf;
//-------------------------------------------------------------------------
//
//		The following pointers/variables are assignments for 26xxx ONLY
//		 - see Setup27xxx() and Setup24423() below for 27xxx and 24xxx
//			assignments respectively.
//
//-------------------------------------------------------------------------
const unsigned int* pInitialize1 = &Initialize1_27x_24x[0];
const unsigned int* pInitialize2 = &Initialize2_27x_24x[0];
const unsigned int* pInitialize3 = &Initialize3_27x_24x[0];
const unsigned int* pIdSetup = &IdSetup_27x_24x[0];
const unsigned int* pEraseAll = &EraseAll_27x_24x[0];
const unsigned int* pProgramBlock = &ProgramBlock_24x[0];
const unsigned int* pVerifySetup = &VerifySetup_27x_24x[0];
const unsigned int* pSecureBlock = &SecureBlock_24x[0];
const unsigned int* pChecksumSetup = &ChecksumSetup_24x[0];
const unsigned int* pEraseBlock = &EraseBlock_A[0];
unsigned int padding = 0x0E;
unsigned int SRAM_Offset = 0;
unsigned int ReadPrefix = 0x0580;
unsigned int WritePrefix = 0x0480000;
unsigned int nNumBlocksInPSoC = BLOCKS_IN_24x_PSOC;
unsigned int nSecureSize = BLOCKS_IN_24x_PSOC - 3; // Do not secure the last 3 blocks... they are used for EEPROM space
//-------------------------------------------------------------------------

#define BLOCK_NUM_61 61
#define HEXFILE_OVERHEAD 6
#define EXTRA_INFO 100
void PSOC_Port_Init()
{
	ENG_MAKE_PSOC_LINES_GPIO;
	CONFIG_POWER_ENA_PAD_TO_GPIO;
	ENG_PSOC_XRES_LOW;              //disable reset
	SET_POWER_ENA_DR_REG_LOW;    	//disable power
	ENG_PSOC_XRES_DIR_OUT;
	SET_POWER_ENA_DATA_DIR_OUTPUT;
	ENG_PSOC_SDATA_DIR_OUT;
	ENG_PSOC_SCLK_DIR_OUT;
}

static void SetAimerAndIllumition()
{
	ENG_PSOC_SDATA_HIGH;
	ENG_PSOC_SCLK_HIGH;
}


// TODO:  this duplicates EngResetPsoc()
void reset_psoc(void)
{
//	if(DEBUG)
//		xputstring ("___Resetting PSOC___\r\n");
	{	// Note:  The IRQ macros create a local variable.  Because we use them twice, we need to localize one set so it compiles (duplicate variable error).
		DISABLE_INTERRUPTS();
		ENG_PSOC_XRES_HIGH;		// Enter reset mode
		RESTORE_INTERRUPTS();
	}
	
	wait.us(100);
	while(!wait.HasExpired());	// Should be at least 10us

	DISABLE_INTERRUPTS();
	ENG_PSOC_XRES_LOW;		// Leave reset mode
	RESTORE_INTERRUPTS();

	wait.us(20);
	while(!wait.HasExpired());	// Should be at least 20us before attempting to aquire
										// Note to aquire psoc, must begin sending the Initialize1 vector within 100us after sending this pulse.
}


static void Setup24423(void)
{
//	From Setup27xxx() in flash_psoc.c
	{
		pInitialize1 = &Initialize1_27x_24x[0];
		pInitialize2 = &Initialize2_27x_24x[0];
		pInitialize3 = &Initialize3_27x_24x[0];
		pIdSetup = &IdSetup_27x_24x[0];
		pEraseAll = &EraseAll_27x_24x[0];
		pProgramBlock = &ProgramBlock_27x[0];
		pVerifySetup = &VerifySetup_27x_24x[0];
		pSecureBlock = &SecureBlock_27x[0];
		pChecksumSetup = &ChecksumSetup_27x[0];
		padding = 0x0007;
		SRAM_Offset = 0;
		ReadPrefix = 0x0580;
		WritePrefix = 0x0480000;
	}
	pProgramBlock = &ProgramBlock_24x[0];
	pSecureBlock = &SecureBlock_24x[0];
	pChecksumSetup = &ChecksumSetup_24x[0];
}


//-------------------------------------------------------------------------
//
//					FLASH ENGINE PSoC
//		Main flashing routine execution for flashing the MPx Engine PSoC
//			begins here and calls down to all other functions in this module.
//
//		The read and write routines, upon entry, assume the clock is at the end
//			 of the LOW period and leave the clock at the end of the LOW period.
//
//		Data is sent to the PSoC valid on the falling edge and received
//			valid on the rising edge.
//
//		Each routine should always leave sdata in the high z state.
//
//-------------------------------------------------------------------------

unsigned int FlashEnginePsoc(const unsigned char *pPsocHexFile, unsigned int length)
{
	unsigned int cPSOC_ID = 0;
	char str[128];
	int product;

	IsDebugOn=GET_SETTING(GeneralDebugOn);

	if(DEBUG)
		xputstring ("Enter FlashEnginePSoC().\r\n");//DMH

	Setup24423();

	if( length >( (nNumBlocksInPSoC*(ENG_PSOC_BLOCK_SIZE + HEXFILE_OVERHEAD) )+ EXTRA_INFO ) )
	{
		if(DEBUG)
		{
			xputstring ("Binary to flash is too large for this device ... \r\n");
			sprintf(str,"length = %d\r\nnNumBlocksInPSoC = %d\r\nPSOC_BLOCK_SIZE = %d\r\n",length,nNumBlocksInPSoC,ENG_PSOC_BLOCK_SIZE);
			xputstring(str);
			product = nNumBlocksInPSoC*ENG_PSOC_BLOCK_SIZE;
			sprintf(str,"PSoC size = %d\r\n",product);
			xputstring(str);
		}
		return 0;
	}

	EnginePSoCflash = TRUE;
	EngHexSize = length;
	pEngHExInRam  = pPsocHexFile;
	if(!EngSetComLines(EngTakeControl))			return	FAIL;
	RESET_WATCHDOG_TIMER();
	if(!EngAcquirePsoc())
		return	FAIL;

	cPSOC_ID = EngVerifyIdPsoc();
	if(DEBUG)
	{
		sprintf (str,"PSoC_ID =  %#06x\r\n", cPSOC_ID );//DMH
		xputstring(str);//DMH
	}
	if(!EraseEnginePsoc())
	{
		EngResetPsoc();
		return	FAIL;
	}
	xputstring( "PROGRAMING...please be patient\r\n" );//DMH

	if(!EngProgramFlashPsoc())			return	FAIL;
	if(!SecureEnginePsoc(&pEng24SecurityArray[0]))
	{
		xputstring( "SecureEnginePsoc() FAILED\r\n");//DMH
		EngResetPsoc();
		return	FAIL;
	}
	if(!EngVerifyFlashChecksumPsoc())
	{
		xputstring( "EngVerifyFlashChecksumPsoc() FAILED\r\n");//DMH
		EngResetPsoc();
		return	FAIL;
	}
	EngResetPsoc();
	EngSetComLines(EngRelease);
	EnginePSoCflash = FALSE;
	xputstring( "PROGRAMMING  COMPLETE  Reset your device!\r\n" );//DMH
	return TRUE;
} //FlashEnginePsoc(const unsigned char *pPsocHexFile, unsigned int length)


//-------------------------------------------------------------------------
//
//				ERASE ENGINE PSoC
//
//-------------------------------------------------------------------------
int EraseEnginePsoc(void)
{
	int RetResult = FAIL;
	const unsigned char *pBinaryInRam;
	const unsigned char *pEndBinaryInRam;
	unsigned int BlockSelectBitstream, length, blocknumber=0;
	pBinaryInRam=EngGetPsocRamCopy(&length);
	pEndBinaryInRam =		pBinaryInRam + length;

	if(!EngAcquirePsoc())
		xputstring("Acquire FAILED while starting to ERASE.\r\n");
	// Erase last block first in case process fails, Good PSoC code is indicated by valid check sum in last Block.
	BlockSelectBitstream = 0x04fa000 + (BLOCK_NUM_61<<4) + padding;	// prefix + blocknumber + padding
	EngSend22bitStreamToPsoc(BlockSelectBitstream);
	EngSendVectorArrayToPsoc(pEraseBlock);
	if (!EngWaitForSdataLowPsoc())			return FAIL;
	RESET_WATCHDOG_TIMER();
	do
	{
		for (unsigned int address = SRAM_Offset ; address < (SRAM_Offset+ENG_PSOC_BLOCK_SIZE) ; )	// send blocks 64 bytes in length
		{
			if (pBinaryInRam  <  pEndBinaryInRam)
				EngWriteByteToSramPsoc(*(pBinaryInRam++), address++);
			else
				EngWriteByteToSramPsoc(0x00, address++); // Fill block with zero's this will keep psoc in rs232 mode after a flash
		}
		BlockSelectBitstream = 0x04fa000 + (blocknumber<<4) + padding;	// prefix + blocknumber + padding
		EngSend22bitStreamToPsoc(BlockSelectBitstream);
		EngSendVectorArrayToPsoc(pEraseBlock);
		if (!EngWaitForSdataLowPsoc())			return FAIL;
		RESET_WATCHDOG_TIMER();
	} while (++blocknumber < (BLOCK_NUM_61 + 1));
	RetResult = PASS;

	return RetResult;
} //EraseEnginePsoc(void)

//-------------------------------------------------------------------------
//
//		INITIALIZE ENGINE PSoC COM LINES
//
//-------------------------------------------------------------------------
unsigned int EngSetComLines(unsigned int action)
{
	static int sdataGIUS,  sclkGUIS;  // Variables to save com lines state
	DISABLE_INTERRUPTS();
	if (action==EngTakeControl)
	{
		ENG_SAVE_COM_LINES_STATE;
		ENG_MAKE_PSOC_LINES_GPIO;
		ENG_PSOC_XRES_LOW;							// Initialize communication lines
		ENG_PSOC_XRES_DIR_OUT;
		ENG_PSOC_SDATA_LOW;
		ENG_PSOC_SDATA_DIR_IN;
		ENG_PSOC_SCLK_LOW;
		ENG_PSOC_SCLK_DIR_OUT;
	}
	else
		ENG_RESTORE_COM_LINES;
	RESTORE_INTERRUPTS();
	return 1;
}

//-------------------------------------------------------------------------
//
//			ACQUIRE ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngAcquirePsoc(void)
{
	int retval=0;
	while (true)
	{
		DISABLE_INTERRUPTS();
		EngResetPsoc();
		EngSendVectorArrayToPsoc(pInitialize1);	// Must begin in less than 100us after the reset pulse
		RESTORE_INTERRUPTS();
		if (!EngWaitForSdataLowPsoc()){xputstring ("EngAcquirePsoc()__1\r\n"); 	break;}
		retval++;
		EngSendVectorArrayToPsoc(pInitialize2);
		if(!EngWaitForSdataLowPsoc()){xputstring ("EngAcquirePsoc()__2\r\n"); 	break;}
		retval++;
		if(EngSendVectorArrayToPsoc(pInitialize3))
			retval++;
		break;
	}
   return retval==3;
}// EngAcquirePsoc(void)

//-------------------------------------------------------------------------
//
//			RESET ENGINE PSOC
//
//-------------------------------------------------------------------------
void EngResetPsoc(void)
{
	DISABLE_INTERRUPTS();
	ENG_PSOC_XRES_HIGH;		// Enter reset mode
	RESTORE_INTERRUPTS();

	wait.us(30);
	while(!wait.HasExpired());	// Should be at least 10us

	{	// Note:  The IRQ macros create a local variable.  Because we use them twice, we need to localize one set so it compiles (duplicate variable error).
		DISABLE_INTERRUPTS();
		ENG_PSOC_XRES_LOW;		// Exit reset mode
		RESTORE_INTERRUPTS();
	}

	wait.us(30);
	while(!wait.HasExpired());	// Should be at least 20us before attempting to aquire
							// Note to aquire psoc, must begin sending the Initialize1 vector within 100us after sending this pulse.
}

//-------------------------------------------------------------------------
//
//			VERIFY ID ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngVerifyIdPsoc()
{
	EngSendVectorArrayToPsoc(pIdSetup);
	if (!EngWaitForSdataLowPsoc()) return FAIL;
	return (EngReadIdPsoc());
}

//-------------------------------------------------------------------------
//
//			READ ID ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngReadIdPsoc(void)
{
	unsigned int b1,b2;
	ReadPrefix = 0x0500;
	b1=EngReadByteFromSramPsoc(READ_PSOC_ID1);
	b2=EngReadByteFromSramPsoc(READ_PSOC_ID2);
	if(DEBUG)
	{
		sprintf (MsgBuf,"PSOC ID = %02X\r\n",(b1<<8)+b2);
		xputstring(MsgBuf);
	}
	return ((b1<<8)+b2);
}

//-------------------------------------------------------------------------
//
//			PROGRAM FLASH ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngProgramFlashPsoc(void)
{
	const unsigned char *pBinaryInRam;
	const unsigned char *pEndBinaryInRam;
	unsigned int length, blocknumber=0;
	unsigned int BlockSelectBitstream, nhexDataOffset = 0;
	pBinaryInRam=EngGetPsocRamCopy(&length);
	pEndBinaryInRam =		pBinaryInRam + length;
	if( length >( (nNumBlocksInPSoC*(ENG_PSOC_BLOCK_SIZE + HEXFILE_OVERHEAD) )+ EXTRA_INFO ) )
	{
		xputstring ("Binary to flash is too large for this device ... ");
		return FAIL;
	}
	if(DEBUG)
		xputstring ("Programming PSOC ... ");
	nhexDataOffset = 5;	// Data in the Intel Hex File Format Array starts after the first 5 bytes.
	nNumBlocksInPSoC -= 2;	// Don't Prog the last 2 blocks if we are a 24xxx PSoC engine.
	do
	{
		for (unsigned int address = SRAM_Offset ; address < (SRAM_Offset+ENG_PSOC_BLOCK_SIZE) ; )	// send blocks 64 bytes in length
		{
			if (pBinaryInRam  <  pEndBinaryInRam)
				EngWriteByteToSramPsoc(*(nhexDataOffset + pBinaryInRam++), address++);
			else
				EngWriteByteToSramPsoc(0x00, address++); // Fill block with zero's this will keep psoc in rs232 mode after a flash
		}
		pBinaryInRam+=nhexDataOffset+1;		// Skip past the Intel EOL check sum and to the next record of data.
		BlockSelectBitstream = 0x04fa000 + (blocknumber<<4) + padding;	// prefix + blocknumber + padding
		EngSend22bitStreamToPsoc(BlockSelectBitstream);
		EngSendVectorArrayToPsoc(pProgramBlock);
		if (!EngWaitForSdataLowPsoc())			return FAIL;
		RESET_WATCHDOG_TIMER();
	} while (++blocknumber < nNumBlocksInPSoC);
	nNumBlocksInPSoC += 2;	// Restore 24xxx PSoC engine memory size.
	if(DEBUG)
		xputstring ("Pass.\r\n");
	return PASS;
}

//-------------------------------------------------------------------------
//
//			VERIFY FLASH ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngVerifyFlashPsoc(void)
{
	unsigned int blocknumber = 0;
	unsigned int BlockSelectBitstream;
//	unsigned char PsocFlashArray[BLOCKS_IN_24x_PSOC*ENG_PSOC_BLOCK_SIZE];
	unsigned char MX1FlashArray[BLOCKS_IN_24x_PSOC*ENG_PSOC_BLOCK_SIZE];
	unsigned int j=0;
	unsigned char psocramvalue,romvalue;
	unsigned int returnstatus= PASS;
	unsigned int length;
	const unsigned char * Rom=EngGetPsocRamCopy(&length);

	do
	{
		BlockSelectBitstream = 0x04fa000 + (blocknumber<<4) + 0x0E;	// prefix + blocknumber + zero padding
		EngSend22bitStreamToPsoc(BlockSelectBitstream);
		EngSendVectorArrayToPsoc(pVerifySetup);
		if (!EngWaitForSdataLowPsocSlow()) return 0;	 // For some reason this wait needs to be done at the lower clock speed
		for (unsigned int address = SRAM_Offset ; address < (SRAM_Offset+ENG_PSOC_BLOCK_SIZE) ;address ++)	// read 64 byte block
		{
			psocramvalue=EngReadByteFromSramPsoc(address);
	//		PsocFlashArray[j]=psocramvalue;
			if (j < length)
				romvalue=Rom[j];
			else
				romvalue=0;
			MX1FlashArray[j]=romvalue;

