Sweet98/Test2016/source/Gen6FoundationApp/FoundationApp/PSOC/PSoC_Engine_ISSP.c
			if (psocramvalue!=MX1FlashArray[j])
			{
				if(DEBUG && blocknumber==0)//DMH && returnstatus
				{
					sprintf(MsgBuf,"block %d  byte %d  expected %#04x  received %#04x\r\n", blocknumber, (address)-SRAM_Offset, (Rom[j]),psocramvalue);
					xputstring(MsgBuf);
				}
					returnstatus=FAIL;
			}
			j++;
		}
		RESET_WATCHDOG_TIMER();
	} while (++blocknumber < nNumBlocksInPSoC);

	if(DEBUG)
	{
	  	if (returnstatus)
			sprintf (MsgBuf,"Pass.\r\n");
	  	else
			sprintf (MsgBuf,"fail.\r\n");
	  xputstring(MsgBuf);
	}
	return returnstatus;
}// verify_flash_psoc(void);

//-------------------------------------------------------------------------
//
//			SECURE ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int SecureEnginePsoc(const unsigned int *pSecurityArray)
{
	unsigned int address = SRAM_Offset ;	// 64 byte block
	do{
		EngWriteByteToSramPsoc( pSecurityArray[address], address ); // Set each blocks protection level
	}while(++address < (SRAM_Offset + (BLOCKS_IN_24x_PSOC)) );
	EngSendVectorArrayToPsoc(pSecureBlock);
	return EngWaitForSdataLowPsoc();
}

//-------------------------------------------------------------------------
//
//			VERIFY FLASH CHECKSUM ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngVerifyFlashChecksumPsoc(void)
{
	char str[128];
	unsigned char cReadByte;
	unsigned int nCalculatedRAMchecksum=0, nPsocAppCheckSum=0, nRegesterChkSum=0;
	unsigned int blocknumber = 62;
	unsigned int BlockSelectBitstream;
	SRAM_Offset = 0x80;
	do
	{
		BlockSelectBitstream = 0x4fa00E + (blocknumber<<4);	// prefix + blocknumber + padding
		if(DEBUG)
		{
			sprintf (str,"BlockSelectBitstream =  %#08x\r\n", BlockSelectBitstream );//DMH
			xputstring(str);//DMH
		}
		EngSend22bitStreamToPsoc(BlockSelectBitstream);
		EngSendVectorArrayToPsoc(pVerifySetup);
		if (!EngWaitForSdataLowPsocSlow()) return 0;	 // For some reason this wait needs to be done at the lower clock speed

		if(DEBUG)
		{
			sprintf (str,"Block %d:\r\n", blocknumber );//DMH
			xputstring(str);//DMH
		}
		for(unsigned int address = SRAM_Offset; address < (SRAM_Offset+ENG_PSOC_BLOCK_SIZE); )	// read 64 byte blocks
		{
			cReadByte = EngReadByteFromSramPsoc(address++);
			if(DEBUG)
			{
				sprintf (str,"%02X ", cReadByte );
				xputstring(str);
			}
			nRegesterChkSum += cReadByte;
		}
		RESET_WATCHDOG_TIMER();
	} while (++blocknumber < nNumBlocksInPSoC);
	SRAM_Offset = 0;

	if(!EngSendVectorArrayToPsoc(pChecksumSetup))
		xputstring("Checksun Setup FAILED!!\r\n");
	if (!EngWaitForSdataLowPsoc())
	{
		xputstring("Checksun Setup FAILED!!\r\n");
		 return 0;
	}

	nPsocAppCheckSum = EngReadFlashChecksumPsoc();

	if(DEBUG)
	{
		sprintf (str,"nPsocAppCheckSum in ROM = %#06X\r\n", nPsocAppCheckSum );//DMH
		xputstring(str);//DMH
		sprintf (str,"nRegesterChkSum = %#06X\r\n", nRegesterChkSum );//DMH
		xputstring(str);//DMH
	}

	nPsocAppCheckSum -= nRegesterChkSum;

	if(DEBUG)
	{
		sprintf (str,"nPsocAppCheckSum in ROM Bk0-> Bk61 = %#06X\r\n", nPsocAppCheckSum );//DMH
		xputstring(str);//DMH
	}
	nCalculatedRAMchecksum = EngCalculateFlashChecksumPsoc();
	if (nPsocAppCheckSum != nCalculatedRAMchecksum)
	{
		if(DEBUG)
		{
			sprintf (str,"Calculated RAM checksum = %#06x\r\nFlash ROM - Reg's =       %#06x\r\n", nCalculatedRAMchecksum, nPsocAppCheckSum );
			xputstring(str);
		}
		return 0;
	}
	if(DEBUG)
		xputstring("verify_flash_checksum_psoc()  PASSED!!!\r\n");
	return 1;
}// EngVerifyFlashChecksumPsoc();

//-------------------------------------------------------------------------
//
//			SEND VECTOR ARRAY TO ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngSendVectorArrayToPsoc(const unsigned int vectorArray[])
{
	unsigned int i=0;
	while (vectorArray[i]!=1)			// End of array marked by 1
	{
		if (vectorArray[i]>0x7ffffe)	//Is the value in the array illegal (> 22 bits)?
		{
			if(DEBUG)
				xputstring("vector value in the array illegal (> 22 bits)\r\n");
			return 0;					// Vector ERROR!
		}
		EngSend22bitStreamToPsoc(vectorArray[i++]);
	}
	return 1;
}

 //-------------------------------------------------------------------------
//
//			SEND BIT STREAM TO ENGINE PSOC uses mask to change length
//
//-------------------------------------------------------------------------
static void send_bit_stream_to_psoc(unsigned int bitstream,	unsigned int Mask)
{
	DISABLE_INTERRUPTS();
	ENG_PSOC_SDATA_DIR_OUT;
	RESTORE_INTERRUPTS();
	do
	{
		if (bitstream & Mask)	// set sdata
		{
			DISABLE_INTERRUPTS();
			ENG_PSOC_SDATA_HIGH;
			RESTORE_INTERRUPTS();
		}
		else
		{
			DISABLE_INTERRUPTS();
			ENG_PSOC_SDATA_LOW;
			RESTORE_INTERRUPTS();
		}
		DISABLE_INTERRUPTS();
		ENG_PSOC_SCLK_HIGH;			// and clock it (valid on falling edge)
		RESTORE_INTERRUPTS();
		HALF_BIT_DELAY;
		{
			DISABLE_INTERRUPTS();
			ENG_PSOC_SCLK_LOW;
			RESTORE_INTERRUPTS();
		}
		HALF_BIT_DELAY;
	} while ((Mask >>= 1)>1);	// Shift right and skip last padding bit
	{
		DISABLE_INTERRUPTS();
		ENG_PSOC_SDATA_LOW;
		ENG_PSOC_SDATA_DIR_IN;			// always leave sdata in high z state
		RESTORE_INTERRUPTS();
	}
}

//-------------------------------------------------------------------------
//
//			SEND 22BIT STREAM TO ENGINE PSOC
//
//-------------------------------------------------------------------------
void EngSend22bitStreamToPsoc(unsigned int bitstream)
{
	send_bit_stream_to_psoc(bitstream,0x0400000); // Send 22 bits of command and skip the last padding bit, see below
}

//-------------------------------------------------------------------------
//
//			SEND 11 BIT STREAM TO ENGINE PSOC
//	This function is inline to minimize latency between writing and reading the psoc
//
//-------------------------------------------------------------------------
inline void send_11bit_stream_to_psoc(unsigned int bitstream)
{
	int mask=0x0400;
	DISABLE_INTERRUPTS();
	ENG_PSOC_SDATA_DIR_OUT;
	while (mask)
	{
		if (bitstream & mask) 	// set sdata
		{
			ENG_PSOC_SDATA_HIGH;
		}
		else
		{
			ENG_PSOC_SDATA_LOW;
		}
		ENG_PSOC_SCLK_HIGH;			// and clock it (valid on falling edge)
		HALF_BIT_DELAY;
		ENG_PSOC_SCLK_LOW;
		HALF_BIT_DELAY;
		mask>>=1;
	}
	ENG_PSOC_SDATA_LOW;
	ENG_PSOC_SDATA_DIR_IN;		   // always leave sdata in high z state
	RESTORE_INTERRUPTS();
}

//-------------------------------------------------------------------------
//
//			READ 8BIT STREAM FROM ENGINE PSOC
//	This function is inline to minimize latency between writing and reading the psoc
//
//-------------------------------------------------------------------------
inline unsigned int EngRead8bitStreamFromPsoc(void)
{
	unsigned int b=0;
	int count=8;
	DISABLE_INTERRUPTS();
	ENG_HIGH_Z_CYCLE_ENTERING_READ;   // clock does /^\_/^
	RESTORE_INTERRUPTS();
	while (count--)
	{
		DISABLE_INTERRUPTS();
		ENG_PSOC_SCLK_LOW;					//  clock it (valid on rising edge)
		HALF_BIT_DELAY_IN_READ_MODE;
		ENG_PSOC_SCLK_HIGH;			//  clock it (valid on rising edge)
		RESTORE_INTERRUPTS();
		b = ( b << 1 ) + (unsigned int)ENG_PSOC_SDATA_READ;
		HALF_BIT_DELAY_IN_READ_MODE;
	}
	{
		DISABLE_INTERRUPTS();
		ENG_HIGH_Z_CYCLE_LEAVING_READ;	  // clock does \_/^\_
		RESTORE_INTERRUPTS();
	}
	return b;
}

//-------------------------------------------------------------------------
//
//			WAIT FOR SDATA LOW ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngWaitForSdataLowPsoc()
{
	volatile unsigned long i=0;
	DISABLE_INTERRUPTS();
	ENG_PSOC_SDATA_DIR_IN;	  // should always be left high z but just to be sure
	while (ENG_PSOC_SDATA_READ == LOW)
	{
		DISABLE_INTERRUPTS();
		ENG_CYCLE_SCLK;
		RESTORE_INTERRUPTS();
		if ( i++ > 500 )
		{
			RESTORE_INTERRUPTS();
			return 0;			// Exact number of cycles required unknown
		}
		RESET_WATCHDOG_TIMER();
	}
	RESTORE_INTERRUPTS();
	i=0;
	while (ENG_PSOC_SDATA_READ == HIGH)
	{
		DISABLE_INTERRUPTS();
		ENG_CYCLE_SCLK;
		RESTORE_INTERRUPTS();
		if ( i++ > 1500000 )		// After the vector to generate the checksum the PSOC requires at least 1.5 million cycles
			return 0;
		RESET_WATCHDOG_TIMER();
	}
	for(i=1;i<100;i++)		// Exact number of cycles required unknown
	{								// extra cycles needed for some reason ???
		DISABLE_INTERRUPTS();
		ENG_CYCLE_SCLK;
		RESTORE_INTERRUPTS();
	}
	return 1;
}

//-------------------------------------------------------------------------
//
//			WAIT FOR SDATA LOW ENGINE PSOC SLOW
//
// For some reason ??? we need this slower clocking when waiting for the PSOC to do a Block Read
//
//-------------------------------------------------------------------------
unsigned int EngWaitForSdataLowPsocSlow()
{
	unsigned long i=0;
	ENG_PSOC_SDATA_DIR_IN;	  		// should always be left high z but just to be sure
	while (ENG_PSOC_SDATA_READ == LOW)
	{
		DISABLE_INTERRUPTS();
		ENG_CYCLE_SCLK;
		RESTORE_INTERRUPTS();
		if ( i++ > 50 )
		{
			if(DEBUG)
			{
				sprintf (MsgBuf,"SDATA failed to go high ... ");
				xputstring(MsgBuf);
			}
			return 0;			// Exact number of cycles required unknown
		}
		RESET_WATCHDOG_TIMER();
	}
	i=0;
	while (ENG_PSOC_SDATA_READ == HIGH)
	{
		DISABLE_INTERRUPTS();
		ENG_CYCLE_SCLK_SLOW;
		RESTORE_INTERRUPTS();
		if ( i++ > 30000 )  // Exact number of cycles required unknown
		{
			if(DEBUG)
			{
				sprintf (MsgBuf,"SDATA failed to go low ... ");
				xputstring(MsgBuf);
			}
			return 0;
		}
		RESET_WATCHDOG_TIMER();
	}
	for(i=1;i<100;i++)		// Exact number of cycles required unknown
	{								// extra cycles needed for some reason ???
		DISABLE_INTERRUPTS();
		ENG_CYCLE_SCLK;
		RESTORE_INTERRUPTS();
	}
	return 1;
}

//-------------------------------------------------------------------------
//
//			WRITE BYTE TO SRAM ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngWriteByteToSramPsoc(unsigned int data, unsigned int address)
{
	unsigned int vector;
	vector = WritePrefix + (address<<12) + (data<<4) + padding;	// write prefix b100 + address + data + zero padding
	EngSend22bitStreamToPsoc(vector);
	return 1;
}

//-------------------------------------------------------------------------
//
//			READ BYTE FROM SRAM ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngReadByteFromSramPsoc(unsigned int address)
{
	unsigned int bite, vector;
	vector=ReadPrefix + address;	// add read prefix
	send_11bit_stream_to_psoc(vector);
	bite = EngRead8bitStreamFromPsoc();
	return bite;
}

//-------------------------------------------------------------------------
//
//			READ FLASH CHECKSUM ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngReadFlashChecksumPsoc(void)
{
	unsigned int b1, b2;
	EngSendVectorArrayToPsoc(pChecksumSetup);
	if (!EngWaitForSdataLowPsoc()) return 0;
	send_11bit_stream_to_psoc(READ_CHECKSUM_BYTE1);	 	// send read stream
	b1=EngRead8bitStreamFromPsoc();		  					// read stream
	send_11bit_stream_to_psoc(READ_CHECKSUM_BYTE2);	 	// send read stream
	b2=EngRead8bitStreamFromPsoc();		  					// read stream
	return (b1<<8) + b2;
}

//-------------------------------------------------------------------------
//
//			CALCULATE FLASH CHECKSUM ENGINE PSOC
//
//-------------------------------------------------------------------------
unsigned int EngCalculateFlashChecksumPsoc(void)
{
	unsigned int i, nBlock=0, checksum=0, length, index=0;
	const unsigned char * Rom;
	Rom = EngGetPsocRamCopy(&length);
	while (nBlock++<62)	//Don't include the EEPROM area in the check sum.
	{
		index+=5;	// advance past Intel Hex format (colon, record length, 2 address bytes, and record type)
		for(i=0; i<64; i++)	// Fetch the 64 bytes of app. code in this record.
			checksum += Rom[index++];	// accumulate the checksum!
		index++;	// advance past Intel Record checksum to the next Record.
	}
	checksum = checksum & 0x0000ffff; // Discard upper bytes
	return checksum;
}

//-------------------------------------------------------------------------
//
//			GET ENGINE PSoC RAM COPY
//
//	Returns a pointer to the array in Program RAM that contains ths PSoC code
//		we want to Verify/Flash and it returns the length of the array in a
//		pointer to an int we supply.
//
//-------------------------------------------------------------------------
const unsigned char * EngGetPsocRamCopy(unsigned int * length)
{
	*length = EngHexSize;
	return pEngHExInRam;
}


